# -*- coding:utf-8 -*-

shortnumber={'章涛':'625','黄海鸿':'655','周钧明':'662','丁颖':'689','孙晓旻':'566','李保勇':'690','魏梦霞':'587','孙憇慧':'530','姜晨':'691','陈伟锋':'522','张松荣':'588','王晓林':'688','金卫国':'667','李平':'665','陶冶之':'664','潘瑛莹':'558','施文':'536','王潇峥':'632','张文瀚':'693','陈全':'563','陈俊名':'526','倪进范':'612','柯铭炜':'613','王新龙':'525','朱程程':'540','李云涛':'672','钱美芳':'658','申晓凤':'687','谭卫':'680','俞越':'626','祁长林':'620','徐劼':'527','沈志峰':'621','费潇':'510','欧阳晓':'513','马蓝':'617','张沈叶':'647','张爽':'645','陈勇':'518','王忻燕':'660','蒋玉菡':'542','刘慧迪':'541','张郁':'615','江玉麟':'614','陈悦娇':'676','王桢浩':'517','严鸣':'545','赵一麟':'511','钱豪天':'685','龚雷':'671','刘苏':'675','王鑫龙':'644','楼凌峰':'637','陈豪':'635','邵雯洁':'646','彭莉洁':'651','袁祝倩':'556','陈莹':'535','杨盛刚':'679','陈璕':'684','陆扬':'653','王未':'678','贺潇':'629','袁珊珊':'633','王晨':'524','汪涣涣':'657','许梦沙':'515','张妤':'572','李骁':'698','顾国君':'648','顾美仙':'649','孙伟':'562','仇寻稚':'682','李睿':'661','冯婷':'561','朱孝琦':'630','李丽':'692','薛峰':'695','王恺':'677','张淑君':'529','吴翔未':'631','顾怡':'640','王雯':'624','余玮':'681','吴悦倩':'512','顾唐杰':'519','张宇':'534','顾晓爽':'650','王毅':'628','赵晓琦':'532','蒋莉莉':'523','阮菲':'673','张薇':'543','刘以明':'521','林豪':'538','陈亮':'618','朱超奕':'642','陈瀚翔':'533','吴中一':'531'}
def handle(content):
    try:
        while shortnumber.get(content):
            value = shortnumber.get(content)
            content = ('%s的短号是%s。' % (content, value))
            return content
        for key in shortnumber.keys():
            if shortnumber.get(key)==content:
                content=('%s是%s的短号。'%(content,key))
                return content
        return '请输入短号或人名'
    except:
        return '未找到!'

while 1:
    content=input()
    print(handle(content))